Repository: jimregan/citizens-information-raw
Catalog: en-ro/www.citizensinformation.ie/ro/moving_country/moving_to_ireland/studying_in_ireland/education_in_ireland.html.txt.tmx
Source language: en
Languages: ro

source: Whether you are a parent, a student or an adult wishing to return to education, it is useful for you to become familiar with the Irish education system
ro: Indiferent dacă sunteţi părinte, elev sau o persoană adultă care doreşte să-şi reia studiile, este util să vă familiarizaţi cu sistemul educaţional irlandez

source: Whatever area of education you wish to pursue for yourself or for your child, it is important to find out as much as possible about the options that are open to you
ro: Indiferent de aria educaţională pe care doriţi să o urmaţi pentru dvs. sau copilul dvs., este important să aflaţi cât mai multe despre opţiunile care vă sunt oferite

source: On the Department of Education and Skills website you can find information about education in Ireland and a guide for parents to the Irish education system (pdf)
ro: Pe site-ul Departamentului pentru Educaţie şi Aptitudini puteţi găsi informaţii despre educaţia în Irlanda şi un ghid pentru părinţi cu privire la sistemul educaţional irlandez (pdf)

source: Pre-school education is usually provided by privately funded childcare facilities or providers
ro: Educaţia preşcolară este furnizată de obicei de instituţii sau furnizori de îngrijire pentru copii cu finanţare privată

source: The Early Childhood Care and Education (ECCE) Scheme provides early childhood care and education for children of pre-school age
ro: Schema de îngrijire şi educaţie pentru copilăria timpurie (ECCE) oferă un an gratuit de îngrijire şi educaţie pentru copiii de vârstă preşcolară

source: At primary and post-primary level, there are different types of schools including multi-denominational and co-educational schools
ro: La nivel primar şi post-primar, există diverse tipuri de şcoli care includ şcoli multidenominaţionale şi şcoli co-educaţionale

source: You can also choose from schools that teach the curriculum through Irish (Gaelscoileanna)
ro: De asemenea, puteţi opta pentru şcoli care predau programa şcolară în limba irlandeză (Gaelscoileanna)

source: You can read more information in our documents, Moving your child to an Irish primary school and Moving your child to an Irish secondary school
ro: Mai multe informaţii puteţi citi în documentele noastre, Mutarea copilului dumneavoastră într-o şcoală primară irlandeză şi Mutarea copilului dumneavoastră într-o şcoală gimnazială irlandeză

source: If you are moving to Ireland for third-level education, there is a range of third-level options; universities, institutes of technologies and the colleges of education are substantially funded by the State
ro: În cazul în care vă mutaţi în Irlanda pentru educaţie terţiară, există o serie de opţiuni în ceea ce priveşte învăţământul terţiar; universităţile, institutele tehnologice şi colegiile de educaţie sunt finanţate substanţial de către stat

source: In addition there are a number of independent private colleges
ro: În plus există o serie de colegii private independente

source: Further education comprises education and training which takes place after second-level schooling but which is not part of the third-level system
ro: Educaţia complementară cuprinde educaţie şi instruire care are loc după învăţământul de nivel secundar dar care nu face parte din sistemul terţiar

source: It includes programmes such as Post-Leaving Certificate courses; the Vocational Training Opportunities Scheme (second-chance education for the unemployed); programmes in Youthreach for early school-leavers; other literacy and basic education; and self-funded evening adult programmes in second-level schools
ro: Aceasta cuprinde programe ca de exemplu cursuri de diplomă post-liceală; Programul de oportunităţi de instruire vocaţională (a doua şansă la educaţie pentru şomeri); programe în cadrul Youthreach pentru cei care abandonează şcoala; alte tipuri de programe de alfabetizare şi educaţie de bază; şi programe serale pentru adulţi cu autofinanţare în şcoli de nivel secundar

source: There are opportunities for adults who wish to return to education or continue their education on a full-time or part-time basis
ro: De asemenea, există oportunităţi pentru persoanele adulte care doresc să-şi reia sau să-şi continue studiile urmând cursuri de zi sau cu frecvenţă redusă

source: State-funded education is available at primary and post-primary levels, so you will not have to pay fees unless you choose to send your child to a private school
ro: Educaţia cu finanţare de stat este disponibilă la nivel primar şi post-primar, ceea ce înseamnă că nu trebuie să plătiţi taxe decât în cazul în care optaţi să vă trimiteţi copilul la o şcoală privată

source: Pre-schools are generally run on a private and fee-paying basis, though there may be some State help in certain circumstances
ro: În general, instituţiile preşcolare funcţionează în sistem privat sau pe bază de taxă, deşi în anumite situaţii poate exista un oarecare ajutor de stat

source: You will have to pay fees for third-level education unless you qualify for "free fees"
ro: Va trebui să plătiţi taxe pentru învăţământul terţiar cu excepţia cazului în care vă încadraţi la „gratuitate”
